[
  {
    "id": "1",
    "title": "PUBG: Battlegrounds",
    "coverPhoto": "https://image.api.playstation.com/vulcan/ap/rnd/202504/1604/fb8c0fd88caf3c887828d8d5b263902343ca58a534a08df2.jpg",
    "category": "FPS",
    "downloadLink": "https://www.pubg.com",
    "description": "PUBG: Battlegrounds is a realistic battle royale shooter that places players into intense survival scenarios where strategy, precision, and awareness are essential. Up to 100 players parachute onto large-scale maps and must scavenge for weapons, armor, medical supplies, and vehicles while the playable area gradually shrinks. The game emphasizes tactical gunplay with realistic recoil, bullet drop, and sound-based awareness. Multiple maps, solo and squad modes, ranking systems, and continuous updates ensure high replayability. PUBG rewards patience, teamwork, and smart positioning, making every match unpredictable and adrenaline-filled.",
    "ratings": "4.5",
    "developer": "Krafton"
  },
  {
    "id": "2",
    "title": "Call of Duty: Warzone",
    "coverPhoto": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSQ2Gve4dNz40DLKjAjaqvs_ERfIVQy5AyMfMXrwR_WYzn2PrhChg2ANZdKro0L2eLkkJLv&s=10",
    "category": "FPS",
    "downloadLink": "https://www.callofduty.com/warzone",
    "description": "Call of Duty: Warzone is a free-to-play battle royale experience that combines fast-paced combat with the iconic gunplay of the Call of Duty franchise. Players drop into a massive map filled with urban areas, open fields, and high-risk zones while collecting weapons, contracts, and equipment. Unique mechanics like the Gulag, loadout drops, and killstreaks add strategic depth. With constant updates, new seasons, and cross-platform support, Warzone delivers cinematic action, competitive gameplay, and intense multiplayer battles.",
    "ratings": "4.6",
    "developer": "Activision"
  },
  {
    "id": "3",
    "title": "Free Fire",
    "coverPhoto": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSi5wHU3IOcKL_hNCFMW74z2WwKPDiaAOspzQ&s",
    "category": "Battle Royale",
    "downloadLink": "https://ff.garena.com",
    "description": "Free Fire is a fast-paced battle royale game designed specifically for mobile devices, offering quick matches and smooth performance even on low-end hardware. Players compete on compact maps where survival depends on quick reflexes, smart looting, and tactical movement. Unique characters with special abilities allow for diverse playstyles, while regular updates introduce new content, events, and cosmetic items. Its accessibility, short match duration, and competitive ranking system make Free Fire one of the most popular mobile shooters worldwide.",
    "ratings": "4.4",
    "developer": "Garena"
  },
  {
    "id": "4",
    "title": "Fortnite",
    "coverPhoto": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRs4c21A9V5lk9nHFgaWSYWzfKgQeFVe7x48g&s",
    "category": "Battle Royale",
    "downloadLink": "https://www.epicgames.com/fortnite",
    "description": "Fortnite is a unique battle royale game that blends shooting, building, and creative expression into one colorful experience. Players fight to survive while constructing structures for defense and mobility. Its cartoon-style visuals, frequent collaborations, and seasonal updates keep the game fresh and culturally relevant. With multiple modes including Zero Build, Creative, and competitive playlists, Fortnite appeals to both casual and competitive players across all platforms.",
    "ratings": "4.7",
    "developer": "Epic Games"
  },
  {
    "id": "5",
    "title": "Apex Legends",
    "coverPhoto": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTmsVeG7QQo6Pug9JxYOU0XMYmu_L7xXOUZVWegA8nBozg0Db_OE9HV2Bpt5x-bnCvlDZKe&s=10",
    "category": "FPS",
    "downloadLink": "https://www.ea.com/games/apex-legends",
    "description": "Apex Legends is a squad-based hero battle royale that focuses on speed, teamwork, and character abilities. Each Legend brings unique skills that encourage coordinated strategies and fast-paced engagements. Smooth movement mechanics like sliding and climbing make combat dynamic and fluid. Regular seasons, ranked modes, and story-driven updates help Apex Legends stand out as a competitive and skill-driven shooter.",
    "ratings": "4.6",
    "developer": "Respawn Entertainment"
  },
  {
    "id": "6",
    "title": "Valorant",
    "coverPhoto": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT4yRDL92t-3y3G74pPOTgdQ2J0F_N8i3Qia_85KP6JkF-lEjL6h8aCdmgafuLOZ1PYm7w4&s=10",
    "category": "FPS",
    "downloadLink": "https://playvalorant.com",
    "description": "Valorant is a tactical 5v5 shooter that combines precise gunplay with hero-based abilities. Each agent has unique skills that influence strategy, map control, and team coordination. Matches reward communication, positioning, and mechanical skill. With a strong esports ecosystem, frequent balance updates, and competitive ranking systems, Valorant has become a leading title in tactical FPS gaming.",
    "ratings": "4.8",
    "developer": "Riot Games"
  },
  {
    "id": "7",
    "title": "Counter-Strike 2",
    "coverPhoto": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQHXtbn14aisvzyOuZAPNgeu2HU2IdGQaerV6fzJZ0UPQalKMZrt_QMudJDe_3GDQyj_CV0&s=10",
    "category": "FPS",
    "downloadLink": "https://store.steampowered.com/app/730",
    "description": "Counter-Strike 2 continues the legendary competitive shooter formula with modern visuals, improved physics, and refined gameplay systems. Teams of terrorists and counter-terrorists face off in objective-based matches that emphasize teamwork, map knowledge, and precise aim. Its skill-based ranking and professional esports scene make it one of the most competitive FPS games ever created.",
    "ratings": "4.7",
    "developer": "Valve"
  },
  {
    "id": "8",
    "title": "Minecraft",
    "coverPhoto": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQG6NPI8plN5tpNYcDFYXF_4MP9YrODDOlV63CRvyF0wgZ7kKHFd-HRUZTAKSqCvIQ6F0ZH&s=10",
    "category": "Sandbox",
    "downloadLink": "https://www.minecraft.net",
    "description": "Minecraft is a sandbox game that allows players to explore, build, and survive in a procedurally generated world made of blocks. Players can gather resources, craft tools, build structures, and face enemies in survival mode or unleash creativity in creative mode. Its open-ended gameplay, modding community, and educational value make Minecraft one of the most influential games of all time.",
    "ratings": "4.8",
    "developer": "Mojang"
  },
  {
    "id": "9",
    "title": "GTA V",
    "coverPhoto": "https://i.pinimg.com/736x/8d/87/49/8d8749772761d6fb08a38737a88ad44a.jpg",
    "category": "Action",
    "downloadLink": "https://www.rockstargames.com/gta-v",
    "description": "Grand Theft Auto V is an open-world action-adventure game set in the sprawling city of Los Santos. Players experience a cinematic story through three protagonists while exploring a massive world filled with missions, side activities, and dynamic events. GTA Online extends the experience with multiplayer heists, businesses, and constant updates, keeping the game relevant years after release.",
    "ratings": "4.9",
    "developer": "Rockstar Games"
  },
  {
    "id": "10",
    "title": "League of Legends",
    "coverPhoto": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTI29PK-OT68a3Jx-n5U0Fi4rvZNv3mYxZKXDOnE2BbiJEqH0ofqVtBto_ofYVkXrZptHZT&s=10",
    "category": "MOBA",
    "downloadLink": "https://www.leagueoflegends.com",
    "description": "League of Legends is a competitive multiplayer online battle arena game where teams of champions fight to destroy the enemy nexus. Each champion has unique abilities and roles, requiring teamwork and strategic planning. Frequent updates, a massive esports scene, and an ever-growing roster make it one of the most played PC games worldwide.",
    "ratings": "4.6",
    "developer": "Riot Games"
  },
  {
    "id": "11",
    "title": "Dota 2",
    "coverPhoto": "https://upload.wikimedia.org/wikipedia/en/3/31/Dota_2_Steam_artwork.jpg",
    "category": "MOBA",
    "downloadLink": "https://www.dota2.com",
    "description": "Dota 2 is a deep and complex MOBA game that emphasizes strategy, hero mastery, and team coordination. Each match offers countless possibilities through item builds, hero combinations, and tactical decisions. Its steep learning curve, competitive ranking system, and international esports tournaments define Dota 2 as a true skill-based experience.",
    "ratings": "4.7",
    "developer": "Valve"
  },
  {
    "id": "12",
    "title": "Clash of Clans",
    "coverPhoto": "https://upload.wikimedia.org/wikipedia/en/5/59/Clash_of_Clans_Logo.png",
    "category": "Strategy",
    "downloadLink": "https://supercell.com/en/games/clashofclans/",
    "description": "Clash of Clans is a mobile strategy game where players build and upgrade villages, train armies, and battle other players worldwide. Strategic planning, base design, and clan cooperation are essential for success. Regular updates, events, and competitive clan wars keep the gameplay engaging and rewarding for long-term players.",
    "ratings": "4.5",
    "developer": "Supercell"
  }
]
